{
  "site_url": "https://www.noktatemizlik.com.tr",
  "timestamp": "20240421-1827",
  "audit_details": [
    "\n [*****] Security headers returned by URL: https://www.noktatemizlik.com.tr: [*****] \n \n",
    "[Recommendation] header Content-Security-Policy not found, consider implementing it! \n",
    "[Recommendation] header access-control-allow-origin not found, consider implementing it! \n",
    "[Recommendation] header Referrer-Policy not found, consider implementing it! \n",
    "[Recommendation] header Clear-Site-Data not found, consider implementing it! \n",
    "[Recommendation] header Strict-Transport-Security not found, consider implementing it! \n",
    "[Recommendation] header x-content-security-policy not found, consider implementing it! \n",
    "[Recommendation] header x-webkit-csp not found, consider implementing it! \n",
    "[Recommendation] header Public-Key-Pins not found, consider implementing it! \n",
    "[Recommendation] header X-XSS-Protection not found, consider implementing it! \n",
    "[Recommendation] header X-Frame-Options not found, consider implementing it! \n",
    "[Recommendation] header X-Frame-Options not found or not properly configured, please implement security header! \n",
    "[Recommendation] header X-Content-Type-Options not found, consider implementing it! \n",
    "[Recommendation] header X-Content-Type-Options not found or not properly configured, please implement security header! \n",
    "[Recommendation] header X-Download-Options not found, consider implementing it! \n",
    "[Recommendation] File Download security is OFF, header X-Download-Options not found or not properly configured, please implement security header! \n",
    "[Recommendation] No content caching policy, header Cache-Control not found or not properly configured, please implement security header! \n",
    "[Recommendation] header X-Permitted-Cross-Domain-Policies not found, consider implementing it! \n",
    "[Recommendation] X-Permitted-Cross-Domain-Policies header not found or not properly configured, please implement security header! \n",
    "[Recommendation] header Strict-Transport-Security not found, consider implementing it! \n",
    "\n [*****]  Checking URL: https://www.noktatemizlik.com.tr  [*****] \n",
    "\n Number of detected forms in URL: 1\n"
  ]
}